#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_role.last-dram-dynamodb-role: Refreshing state... [id=last-dram-dynamodb-role]
aws_appsync_resolver.listBottles-resolver: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4-Query-listBottles]
aws_appsync_graphql_api.last-dram-api: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4]
aws_cognito_user_pool.last-dram-user-pool: Refreshing state... [id=us-east-1_CUtQR75De]
aws_dynamodb_table.bottles-table: Refreshing state... [id=Bottles]
aws_dynamodb_table.user-bottles-table: Refreshing state... [id=UserBottles]
aws_appsync_api_key.api-key: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4:da2-l7naysv2rvgu5o3ct5yevjkf4i]
aws_cognito_user_pool_client.client: Refreshing state... [id=5895or4do2dt98m6sjh963eer2]
aws_iam_role_policy.last-dram-dynamodb-policy: Refreshing state... [id=last-dram-dynamodb-role:last-dram-dynamodb-policy]
aws_appsync_datasource.bottles-datasource: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4-bottles_datasource]
aws_appsync_resolver.createBottle-resolver: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4-Mutation-createBottle]
aws_appsync_resolver.updateBottle-resolver: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4-Mutation-updateBottle]
aws_appsync_resolver.getBottle-resolver: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4-Query-getBottle]
aws_appsync_resolver.deleteBottle-resolver: Refreshing state... [id=u6dc5ni4yrbabooim4i24edtd4-Mutation-deleteBottle]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_cognito_user_pool.last-dram-user-pool has changed
  ~ resource "aws_cognito_user_pool" "last-dram-user-pool" {
      ~ estimated_number_of_users = 6 -> 7
        id                        = "us-east-1_CUtQR75De"
        name                      = "last-dram-user-pool"
        tags                      = {}
        # (7 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }

  # aws_dynamodb_table.user-bottles-table has changed
  ~ resource "aws_dynamodb_table" "user-bottles-table" {
        id             = "UserBottles"
        name           = "UserBottles"
      + tags           = {}
        # (7 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_appsync_datasource.user-bottles-datasource will be created
  + resource "aws_appsync_datasource" "user-bottles-datasource" {
      + api_id           = "u6dc5ni4yrbabooim4i24edtd4"
      + arn              = (known after apply)
      + id               = (known after apply)
      + name             = "user_bottles_datasource"
      + service_role_arn = "arn:aws:iam::062130427086:role/last-dram-dynamodb-role"
      + type             = "AMAZON_DYNAMODB"

      + dynamodb_config {
          + region     = (known after apply)
          + table_name = "UserBottles"
        }
    }

  # aws_appsync_graphql_api.last-dram-api will be updated in-place
  ~ resource "aws_appsync_graphql_api" "last-dram-api" {
        id                  = "u6dc5ni4yrbabooim4i24edtd4"
        name                = "last-dram-api"
      ~ schema              = <<-EOT
            type Query {
          -     getBottle(id: String!, userId: String!): Bottle
          -     listBottles(filter: BottleFilterInput, limit: Int, nextToken: String): Bottles
          +     getBottle(id: String!, userId: String!): UserBottle
          +     listBottles(filter: BottleFilterInput, limit: Int, nextToken: String): UserBottles
          +     listUserBottles(filter: BottleFilterInput, limit: Int, nextToken: String): UserBottles
            }
            
            type Mutation {
          -     createBottle(input: CreateBottleInput!): Bottle
          -     updateBottle(input: UpdateBottleInput!): Bottle
          -     deleteBottle(input: DeleteBottleInput!): Bottle
          +     createBottle(input: CreateBottleInput!): UserBottle
          +     createUserBottle(input: CreateBottleInput!): UserBottle
          +     updateBottle(input: UpdateBottleInput!): UserBottle
          +     updateUserBottle(input: UpdateBottleInput!): UserBottle
          +     deleteBottle(input: DeleteBottleInput!): UserBottle
          +     deleteUserBottle(input: DeleteBottleInput!): UserBottle
            }
            
          - type Bottle {
          + interface Bottle {
                id: String!
          -     userId: String!
                name: String
                imageUrl: String
          + }
          + 
          + type UserBottle implements Bottle {
          +     id: String!
          +     name: String
          +     imageUrl: String
          +     userId: String!
                dateOpened: String
                dateAcquired: String
            }
            
            type Bottles {
                items: [Bottle]
                nextToken: String
            }
            
          + type UserBottles {
          +     items: [UserBottle]
          +     nextToken: String
          + }
          + 
            input BottleFilterInput {
                id: TableStringFilterInput
                userId: TableStringFilterInput
                name: TableStringFilterInput
                imageUrl: TableStringFilterInput
                dateOpened: TableStringFilterInput
                dateAcquired: TableStringFilterInput
            }
            
            input CreateBottleInput {
                id: String!
                userId: String!
                name: String!
                imageUrl: String
                dateOpened: String
                dateAcquired: String
            }
            
            input UpdateBottleInput {
                id: String!
                name: String
                imageUrl: String
                dateOpened: String
                dateAcquired: String
            }
            
            input DeleteBottleInput {
                id: String!
            }
            
            input TableStringFilterInput {
                ne: String
                eq: String
                le: String
                lt: String
                ge: String
                gt: String
                contains: String
                notContains: String
                between: [String]
                beginsWith: String
            }
            
            input TableBooleanFilterInput {
                ne: Boolean
                eq: Boolean
            }
            
            input TableIntFilterInput {
                ne: Int
                eq: Int
                le: Int
                lt: Int
                ge: Int
                gt: Int
                contains: Int
                notContains: Int
                between: [Int]
            }
        EOT
        tags                = {}
        # (5 unchanged attributes hidden)
    }

  # aws_appsync_resolver.createBottle-resolver will be updated in-place
  ~ resource "aws_appsync_resolver" "createBottle-resolver" {
      ~ data_source       = "bottles_datasource" -> "user_bottles_datasource"
        id                = "u6dc5ni4yrbabooim4i24edtd4-Mutation-createBottle"
        # (8 unchanged attributes hidden)
    }

  # aws_appsync_resolver.deleteBottle-resolver will be updated in-place
  ~ resource "aws_appsync_resolver" "deleteBottle-resolver" {
      ~ data_source       = "bottles_datasource" -> "user_bottles_datasource"
        id                = "u6dc5ni4yrbabooim4i24edtd4-Mutation-deleteBottle"
        # (8 unchanged attributes hidden)
    }

  # aws_appsync_resolver.getBottle-resolver will be updated in-place
  ~ resource "aws_appsync_resolver" "getBottle-resolver" {
      ~ data_source       = "bottles_datasource" -> "user_bottles_datasource"
        id                = "u6dc5ni4yrbabooim4i24edtd4-Query-getBottle"
        # (8 unchanged attributes hidden)
    }

  # aws_appsync_resolver.listBottles-resolver will be destroyed
  # (because aws_appsync_resolver.listBottles-resolver is not in configuration)
  - resource "aws_appsync_resolver" "listBottles-resolver" {
      - api_id            = "u6dc5ni4yrbabooim4i24edtd4" -> null
      - arn               = "arn:aws:appsync:us-east-1:062130427086:apis/u6dc5ni4yrbabooim4i24edtd4/types/Query/resolvers/listBottles" -> null
      - data_source       = "bottles_datasource" -> null
      - field             = "listBottles" -> null
      - id                = "u6dc5ni4yrbabooim4i24edtd4-Query-listBottles" -> null
      - kind              = "UNIT" -> null
      - max_batch_size    = 0 -> null
      - request_template  = <<-EOT
            {
              "version": "2017-02-28",
              "operation": "Scan",
              "filter": #if($context.args.filter) $util.transform.toDynamoDBFilterExpression($ctx.args.filter) #else null #end,
              "limit": $util.defaultIfNull($ctx.args.limit, 20),
              "nextToken": $util.toJson($util.defaultIfNullOrEmpty($ctx.args.nextToken, null)),
            }
        EOT -> null
      - response_template = "$util.toJson($context.result)" -> null
      - type              = "Query" -> null
    }

  # aws_appsync_resolver.listUserBottles-resolver will be created
  + resource "aws_appsync_resolver" "listUserBottles-resolver" {
      + api_id            = "u6dc5ni4yrbabooim4i24edtd4"
      + arn               = (known after apply)
      + data_source       = "user_bottles_datasource"
      + field             = "listBottles"
      + id                = (known after apply)
      + kind              = "UNIT"
      + request_template  = <<-EOT
            {
              "version": "2017-02-28",
              "operation": "Scan",
              "filter": #if($context.args.filter) $util.transform.toDynamoDBFilterExpression($ctx.args.filter) #else null #end,
              "limit": $util.defaultIfNull($ctx.args.limit, 20),
              "nextToken": $util.toJson($util.defaultIfNullOrEmpty($ctx.args.nextToken, null)),
            }
        EOT
      + response_template = "$util.toJson($context.result)"
      + type              = "Query"
    }

  # aws_appsync_resolver.updateBottle-resolver will be updated in-place
  ~ resource "aws_appsync_resolver" "updateBottle-resolver" {
      ~ data_source       = "bottles_datasource" -> "user_bottles_datasource"
        id                = "u6dc5ni4yrbabooim4i24edtd4-Mutation-updateBottle"
        # (8 unchanged attributes hidden)
    }

  # aws_iam_role_policy.last-dram-dynamodb-policy will be updated in-place
  ~ resource "aws_iam_role_policy" "last-dram-dynamodb-policy" {
        id     = "last-dram-dynamodb-role:last-dram-dynamodb-policy"
        name   = "last-dram-dynamodb-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            "arn:aws:dynamodb:us-east-1:062130427086:table/Bottles",
                          + "arn:aws:dynamodb:us-east-1:062130427086:table/UserBottles",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 6 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>